// 定义数据项的类型
type HomePageItem = {
  id: number;
  text: string;
};

// 首页数据
export const homePageData: HomePageItem[] = [
  { id: 1, text: '欢迎来到 易京同城交易' },
  { id: 2, text: '海量房源，任您挑选' },
  { id: 3, text: '优质工作，职等你来' },
  { id: 4, text: '二手好物，实惠交易' },
  { id: 5, text: '本地生活，精彩无限' },
  { id: 12, text: '欢迎来到 易京同城交易' },
  { id: 122, text: '海量房源，任您挑选' },
  { id: 32, text: '优质工作，职等你来' },
  { id: 42, text: '二手好物，实惠交易' },
  { id: 52, text: '本地生活，精彩无限' },
  { id: 15, text: '本地生活，精彩无限' },
  { id: 112, text: '欢迎来到 易京同城交易' },
  { id: 222, text: '海量房源，任您挑选' },
  { id: 232, text: '优质工作，职等你来' },
  { id: 242, text: '二手好物，实惠交易' },
  { id: 252, text: '本地生活，精彩无限' },
  { id: 35, text: '本地生活，精彩无限' },
  { id: 312, text: '欢迎来到 易京同城交易' },
  { id: 322, text: '海量房源，任您挑选' },
  { id: 332, text: '优质工作，职等你来' },
  { id: 342, text: '二手好物，实惠交易' },
  { id: 452, text: '本地生活，精彩无限' },
  { id: 45, text: '本地生活，精彩无限' },
  { id: 412, text: '欢迎来到 易京同城交易' },
  { id: 422, text: '海量房源，任您挑选' },
  { id: 432, text: '优质工作，职等你来' },
  { id: 442, text: '二手好物，实惠交易' },
  { id: 552, text: '本地生活，精彩无限' },
];